## Plan Result (sbox_landing - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 15 to change, 1 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_rotating.rotate
* Update
  * azurerm_container_group.runner[&#34;00dlrm-ingestionengine&#34;]
  * azurerm_container_group.runner[&#34;01dlrm-ingestionengine&#34;]
  * module.logic[&#34;00&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;00&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;00&#34;].azurerm_service_plan.this
  * module.logic[&#34;00&#34;].azurerm_storage_account.this
  * module.logic[&#34;01&#34;].azurerm_logic_app_standard.this
  * module.logic[&#34;01&#34;].azurerm_private_endpoint.this
  * module.logic[&#34;01&#34;].azurerm_service_plan.this
  * module.logic[&#34;01&#34;].azurerm_storage_account.this
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.logic[&#34;00&#34;].module.application_insights.azurerm_application_insights.this
  * module.logic[&#34;00&#34;].module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.logic[&#34;01&#34;].module.application_insights.azurerm_application_insights.this
  * module.logic[&#34;01&#34;].module.application_insights.azurerm_monitor_activity_log_alert.main[0]
* Replace
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;landing&#34;].time_static.pim_expiry




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_container_group.runner["00dlrm-ingestionengine"] will be updated in-place
  ~ resource "azurerm_container_group" "runner" {
        id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.ContainerInstance/containerGroups/ingest00-runner-sbox"
        name                        = "ingest00-runner-sbox"
      ~ tags                        = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_container_group.runner["01dlrm-ingestionengine"] will be updated in-place
  ~ resource "azurerm_container_group" "runner" {
        id                          = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.ContainerInstance/containerGroups/ingest01-runner-sbox"
        name                        = "ingest01-runner-sbox"
      ~ tags                        = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (14 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.logic["00"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
        id                                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Web/sites/ingest00-logic-sbox"
        name                                     = "ingest00-logic-sbox"
      ~ tags                                     = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
      - vnet_content_share_enabled               = true -> null
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Network/privateEndpoints/ingest00logicsbox-pe"
        name                          = "ingest00logicsbox-pe"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["00"].azurerm_service_plan.this will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Web/serverFarms/ingest00-app-service-plan-sbox"
        name                            = "ingest00-app-service-plan-sbox"
      ~ tags                            = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # module.logic["00"].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Storage/storageAccounts/ingest00logicsbox"
        name                               = "ingest00logicsbox"
      ~ tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.logic["01"].azurerm_logic_app_standard.this will be updated in-place
  ~ resource "azurerm_logic_app_standard" "this" {
        id                                       = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-logic-sbox/providers/Microsoft.Web/sites/ingest01-logic-sbox"
        name                                     = "ingest01-logic-sbox"
      ~ tags                                     = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["01"].azurerm_private_endpoint.this will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-logic-sbox/providers/Microsoft.Network/privateEndpoints/ingest01logicsbox-pe"
        name                          = "ingest01logicsbox-pe"
      ~ tags                          = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["01"].azurerm_service_plan.this will be updated in-place
  ~ resource "azurerm_service_plan" "this" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-logic-sbox/providers/Microsoft.Web/serverFarms/ingest01-app-service-plan-sbox"
        name                            = "ingest01-app-service-plan-sbox"
      ~ tags                            = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (12 unchanged attributes hidden)
    }

  # module.logic["01"].azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-logic-sbox/providers/Microsoft.Storage/storageAccounts/ingest01logicsbox"
        name                               = "ingest01logicsbox"
      ~ tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["curated"].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
        name                               = "ingest00curatedsbox"
        tags                               = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "autoShutdown"        = "true"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
            "startupMode"         = "always"
        }
        # (96 unchanged attributes hidden)

      ~ network_rules {
          ~ default_action             = "Allow" -> "Deny"
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.data_landing_zone["00"].module.storage["landing"].time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 24 -> (known after apply)
      ~ hour    = 14 -> (known after apply)
      ~ id      = "2025-02-24T14:01:26Z" -> (known after apply)
      ~ minute  = 1 -> (known after apply)
      ~ month   = 2 -> (known after apply)
      ~ rfc3339 = "2025-02-24T14:01:26Z" -> (known after apply) # forces replacement
      ~ second  = 26 -> (known after apply)
      ~ unix    = 1740405686 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.logic["00"].module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Insights/components/data-landing-sbox"
        name                                  = "data-landing-sbox"
      ~ tags                                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # module.logic["00"].module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-logic-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - data-landing-sbox"
        name                = "Application Insights daily cap reached - data-landing-sbox"
      ~ tags                = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.logic["01"].module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-logic-sbox/providers/Microsoft.Insights/components/data-landing-sbox"
        name                                  = "data-landing-sbox"
      ~ tags                                  = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (16 unchanged attributes hidden)
    }

  # module.logic["01"].module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-logic-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - data-landing-sbox"
        name                = "Application Insights daily cap reached - data-landing-sbox"
      ~ tags                = {
            "Data-Ingest-Project" = "DLRM Ingestion Engine"
            "application"         = "dlrm-data-ingest"
            "builtFrom"           = "hmcts/dlrm-data-ingest-infra"
            "businessArea"        = "cross-cutting"
            "criticality"         = "Low"
            "environment"         = "sandbox"
            "expiresAfter"        = "3000-01-01"
          - "startupMode"         = "always" -> null
        }
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 2 to add, 15 to change, 1 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.storage["landing"].time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-03-01T14:01:26Z"
      - rotation_rfc3339 = "2025-02-24T14:01:26Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":70,"Program":"tfcmt","SHA1":"","Target":"sbox_landing - TerraformPlanApply","Vars":{}} -->